import random
import re

def random_word(n):
    s = ""
    alphabet = "abc"
    for i in range(n):
        s = s + alphabet[random.randint(0, 2)]
    return s

def check_word(word):
    pattern = r'^(aaa|bbb|cc|ab(ccc)*|aa)*(aa|bbb|aab(cc)*|bbbb)*(aaa|bbb|cc|ab(ccc)*|aa)*$'
    return bool(re.fullmatch(pattern, word))

## для каждого состояния список из 4 элементов:
## в какое состояние можно попасть по a, b, c (если нельзя, то -1) и метка о конечности состояния(конечное 1, иначе -1)

DFA = [
    [19, 20, 21, 1],
    [28, 29, 27, 1],
    [28, 29, 2, 1],
    [3, 34, 27, 1],
    [19, 5, 21, 1],
    [25, 6, 27, 1],
    [25, 4, 27, 1],
    [25, 7, 27, 1],
    [11, 34, 27, 1],
    [25, 43, 10, 1],
    [28, 29, 9, 1],
    [8, 47, 27, 1],
    [19, 20, 12, 1],
    [13, 17, 21, 1],
    [19, 15, 21, 1],
    [19, 16, 21, 1],
    [25, 14, 27, 1],
    [19, 52, 18, 1],
    [-1, -1, 12, -1],
    [49, 50, -1, -1],
    [-1, 22, -1, -1],
    [-1, -1, 0, -1],
    [-1, 23, -1, -1],
    [19, 24, 21, 1],
    [25, 26, 27, 1],
    [38, 32, -1, -1],
    [-1, 4, -1, -1],
    [-1, -1, 1, -1],
    [31, 32, -1, -1],
    [-1, 30, -1, -1],
    [-1, 1, -1, -1],
    [3, 29, 27, 1],
    [28, 29, 33, 1],
    [-1, -1, 2, -1],
    [28, 35, 33, 1],
    [-1, 36, -1, -1],
    [28, 37, 27, 1],
    [28, 35, 27, 1],
    [8, 39, 27, 1],
    [25, 40, 41, 1],
    [-1, 7, -1, -1],
    [-1, -1, 42, -1],
    [25, 43, 41, 1],
    [-1, 44, -1, -1],
    [-1, 45, -1, -1],
    [25, 46, 27, 1],
    [25, 40, 27, 1],
    [25, 40, 48, 1],
    [-1, -1, 9, -1],
    [13, 51, 21, 1],
    [19, 20, 18, 1],
    [25, 26, 41, 1],
    [-1, 14, -1, -1]

]

def checkDFA(word):
    current_state = 0
    for c in word:
        ind = ord(c)-97
        if DFA[current_state][ind] > -1:
            current_state = DFA[current_state][ind]
        else:
            return False
    if DFA[current_state][3] == 1:
        return True
    return False

## NFA
## номер состояния, обозначение на рисунке

'''
0: ε_0 
1: ε_1 
2: ε_2 
3: a_0_8_13
4: a_1
5: b_3
6: b_4
7: c_6
8: b_9
9: c_10
10: c_11
11: a_15_20
12: a_21
13: b_17_25
14: b_18_26
15: b_27
16: b_22
17: c_23
18: a_29_37_42
19: a_30
20: b_32
21: b_33
22: c_35
23: b_38
24: c_39
25: c_40
'''

fin_NFA = [2]
##
## Для каждого состояния храним список из 4 элементов
## В какие состояния можно попасть по a, b, c, ε
NFA = [
    [[3], [5], [7], [1]],
    [[11], [13], [], [2]],
    [[18], [20], [22], []],
    [[0, 4], [8], [], []],
    [[0], [], [], []],
    [[], [6], [], []],
    [[], [0], [], []],
    [[], [], [0], []],
    [[], [], [9], [0]],
    [[], [], [10], []],
    [[], [], [8], []],
    [[1, 12], [], [], []],
    [[], [16], [], []],
    [[], [14], [], []],
    [[], [1, 15], [], []],
    [[], [1], [], []],
    [[], [], [17], [1]],
    [[], [], [16], []],
    [[2, 19], [23], [], []],
    [[2], [], [], []],
    [[], [21], [], []],
    [[], [2], [], []],
    [[], [], [2], []],
    [[], [], [24], [2]],
    [[], [], [25], []],
    [[], [], [2], []],
]

def checkNFA(word, state=0):
    if len(word) == 0:
        if state in fin_NFA:
            return True
        else:
            for i in NFA[state][3]:
                if checkNFA(word, i):
                    return True
        return False

    letter = word[0]

    for i in NFA[state][ord(letter) - 97]:
        if checkNFA(word[1:], i):
            return True

    for i in NFA[state][3]:
        if checkNFA(word, i):
            return True

    return False

##AFA
## 1 часть совпадает с ДКА
# 2 часть
# номер состояния, обозначение на рисунке
'''
53 ε
54 a
55 b
56 c
57 aa
58 bb
59 cc
'''


## для каждого состояния список из 4 элементов:
## в какое состояние можно попасть по a, b, c (если нельзя, то -1) и метка о конечности состояния(конечное 1, иначе -1)

AFA = [
    [19, 20, 21, 1],
    [28, 29, 27, 1],
    [28, 29, 2, 1],
    [3, 34, 27, 1],
    [19, 5, 21, 1],
    [25, 6, 27, 1],
    [25, 4, 27, 1],
    [25, 7, 27, 1],
    [11, 34, 27, 1],
    [25, 43, 10, 1],
    [28, 29, 9, 1],
    [8, 47, 27, 1],
    [19, 20, 12, 1],
    [13, 17, 21, 1],
    [19, 15, 21, 1],
    [19, 16, 21, 1],
    [25, 14, 27, 1],
    [19, 52, 18, 1],
    [-1, -1, 12, -1],
    [49, 50, -1, -1],
    [-1, 22, -1, -1],
    [-1, -1, 0, -1],
    [-1, 23, -1, -1],
    [19, 24, 21, 1],
    [25, 26, 27, 1],
    [38, 32, -1, -1],
    [-1, 4, -1, -1],
    [-1, -1, 1, -1],
    [31, 32, -1, -1],
    [-1, 30, -1, -1],
    [-1, 1, -1, -1],
    [3, 29, 27, 1],
    [28, 29, 33, 1],
    [-1, -1, 2, -1],
    [28, 35, 33, 1],
    [-1, 36, -1, -1],
    [28, 37, 27, 1],
    [28, 35, 27, 1],
    [8, 39, 27, 1],
    [25, 40, 41, 1],
    [-1, 7, -1, -1],
    [-1, -1, 42, -1],
    [25, 43, 41, 1],
    [-1, 44, -1, -1],
    [-1, 45, -1, -1],
    [25, 46, 27, 1],
    [25, 40, 27, 1],
    [25, 40, 48, 1],
    [-1, -1, 9, -1],
    [13, 51, 21, 1],
    [19, 20, 18, 1],
    [25, 26, 41, 1],
    [-1, 14, -1, -1],

    [54, 55, 56, 1],
    [57, 58, 56, -1],
    [54, 58, 56, -1],
    [54, 55, 59, -1],
    [57, 58, 56, 1],
    [54, 58, 56, 1],
    [54, 55, 59, 1]

]

def checkAFA(word):
    current_state1 = 0
    current_state2 = 53

    for c in word:
        ind = ord(c)-97
        if AFA[current_state1][ind] > -1 and AFA[current_state2][ind] > -1:
            current_state1 = AFA[current_state1][ind]
            current_state2 = AFA[current_state2][ind]
        else:
            return False
    if AFA[current_state1][3] == 1 and AFA[current_state2][3] == 1:
        return True
    return False


g = True

for i in range(100):
    for j in range(20):
        word = random_word(j)
        t1 = check_word(word)
        t2 = checkDFA(word)
        t3 = checkNFA(word)
        t4 = checkAFA(word)
        if not (t1 == t2 and t1 == t3 and t1 == t4):
            print(word, "тест провален")
            print(t1, t2, t3, t4)
            g = False

if g:
    print("все тесты пройдены")
else:
    print("не все тесты пройдены")

